АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/рфп_ОтгрузкаВагона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рфп_ОтгрузкаВагона</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыВходящейОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгруженСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>_Пиловочник</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>_Порода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>_Сорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>_Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_СтатусыВходящейОтгрузки/алк_СтатусыВходящейОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыВходящейОтгрузки</name>
  <enumValues>
    <name>ВПути</name>
    <comment>Выехал с пункта отправления</comment>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
    <comment>Транспорт приехал на АЛК</comment>
  </enumValues>
  <enumValues>
    <name>Разгружен</name>
    <comment>Разгрузиди несортированную</comment>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <comment>Оформлен акт приемки</comment>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПрибылНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл);
КонецПроцедуры

&НаКлиенте
Процедура Прибыл(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		ПрибылНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазгруженСиламиПодрядчикаНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РазгруженСиламиПодрядчика(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		РазгруженСиламиПодрядчикаНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РазгруженСобственнымиСиламиНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РазгруженСобственнымиСилами(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		РазгруженСобственнымиСиламиНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПринятНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Принят);
КонецПроцедуры

&НаКлиенте
Процедура Принят(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		ПринятНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры
